app/controllers/epicenter_controller.rb

  def feed
  	@following_tweets = []

  	Tweet.all.each do |tweet|
  		if current_user.following.include?(tweet.user.id) || current_user.id == tweet.user_id
---
SELECT "tweets".* FROM "tweets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def now_following
    current_user.following.push(params[:id].to_i)
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 2\n"], ["updated_at", "2018-03-07 18:33:21.978480"], ["id", 3]]

  def unfollow
    current_user.following.delete(params[:id].to_i)
    current_user.save
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2018-03-07 18:37:15.776585"], ["id", 3]]

  def tag_tweets
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def all_users
    @user = User.all
---
SELECT "users".* FROM "users"

  def following
    @user = User.find(params[:id])
    @users = []

    User.all.each do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def followers
    @user =  User.find(params[:id])
    @users = []

    User.all.each do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users"